export const DescriptionMapping:{AbilityMapping:{[key:number]:string},[key:string]:{[key:number]:string},YiChang:{[key:number]:string}} = {
	AbilityMapping:{
		0:'攻击',
		1:'特攻',
		2:"防御",
		3:"特防",
		4:"速度",
		5:"命中"
	},
	YiChang:{
		0:"麻痹",
		1:"中毒",
		2:"烧伤",
		4:"寄生",
		5:"冻伤",
		6:"害怕",
		7:"疲惫",
		8:"睡眠",
		9:"石化",
		10:"混乱",
		11:"衰弱",
		12:"山神守护",
		13:"易燃",
		14:"狂暴",
		15:"冰封",
		16:"流血",
		19:"瘫痪",
		20:"失明",
		22:"焚烬",
		23:"诅咒",
		27:"感染",
		28:"束缚",
		29:"失神",
		30:"沉默",
		31:"臣服",
		32:"凝滞",
	}
}

export const TYPE_MAP = new Map(new Map([
	[0,"所有"],
	[
			1,
			"草"
	],
	[
			2,
			"水"
	],
	[
			3,
			"火"
	],
	[
			4,
			"飞行"
	],
	[
			5,
			"电"
	],
	[
			6,
			"机械"
	],
	[
			7,
			"地面"
	],
	[
			8,
			"普通"
	],
	[
			9,
			"冰"
	],
	[
			10,
			"超能"
	],
	[
			11,
			"战斗"
	],
	[
			12,
			"光"
	],
	[
			13,
			"暗影"
	],
	[
			14,
			"神秘"
	],
	[
			15,
			"龙"
	],
	[
			16,
			"圣灵"
	],
	[
			17,
			"次元"
	],
	[
			18,
			"远古"
	],
	[
			19,
			"邪灵"
	],
	[
			20,
			"自然"
	],
	[
			21,
			"草 超能"
	],
	[
			22,
			"草 战斗"
	],
	[
			23,
			"草 暗影"
	],
	[
			24,
			"水 超能"
	],
	[
			25,
			"水 暗影"
	],
	[
			26,
			"水 龙"
	],
	[
			27,
			"火 飞行"
	],
	[
			28,
			"火 龙"
	],
	[
			29,
			"火 超能"
	],
	[
			30,
			"飞行 超能"
	],
	[
			31,
			"光 飞行"
	],
	[
			32,
			"飞行 龙"
	],
	[
			33,
			"电 火"
	],
	[
			34,
			"电 冰"
	],
	[
			35,
			"电 战斗"
	],
	[
			36,
			"暗影 电"
	],
	[
			37,
			"机械 地面"
	],
	[
			38,
			"机械 超能"
	],
	[
			39,
			"机械 龙"
	],
	[
			40,
			"地面 龙"
	],
	[
			41,
			"战斗 地面"
	],
	[
			42,
			"地面 暗影"
	],
	[
			43,
			"冰 龙"
	],
	[
			44,
			"冰 光"
	],
	[
			45,
			"冰 暗影"
	],
	[
			46,
			"超能 冰"
	],
	[
			47,
			"战斗 火"
	],
	[
			48,
			"战斗 暗影"
	],
	[
			49,
			"光 神秘"
	],
	[
			50,
			"暗影 神秘"
	],
	[
			51,
			"神秘 超能"
	],
	[
			52,
			"圣灵 光"
	],
	[
			53,
			"飞行 神秘"
	],
	[
			54,
			"地面 超能"
	],
	[
			55,
			"暗影 龙"
	],
	[
			56,
			"圣灵 暗影"
	],
	[
			57,
			"远古 战斗"
	],
	[
			58,
			"火 神秘"
	],
	[
			59,
			"光 战斗"
	],
	[
			60,
			"神秘 战斗"
	],
	[
			61,
			"次元 战斗"
	],
	[
			62,
			"邪灵 神秘"
	],
	[
			63,
			"远古 龙"
	],
	[
			64,
			"光 次元"
	],
	[
			65,
			"远古 圣灵"
	],
	[
			66,
			"水 战斗"
	],
	[
			67,
			"电 龙"
	],
	[
			68,
			"光 火"
	],
	[
			69,
			"光 暗影"
	],
	[
			70,
			"邪灵 龙"
	],
	[
			71,
			"远古 神秘"
	],
	[
			72,
			"机械 次元"
	],
	[
			73,
			"战斗 龙"
	],
	[
			74,
			"战斗 自然"
	],
	[
			75,
			"邪灵 机械"
	],
	[
			76,
			"电 次元"
	],
	[
			77,
			"远古 火"
	],
	[
			78,
			"圣灵 战斗"
	],
	[
			79,
			"圣灵 次元"
	],
	[
			80,
			"圣灵 电"
	],
	[
			81,
			"远古 地面"
	],
	[
			82,
			"远古 草"
	],
	[
			83,
			"自然 龙"
	],
	[
			84,
			"冰 神秘"
	],
	[
			85,
			"飞行 暗影"
	],
	[
			86,
			"冰 火"
	],
	[
			87,
			"冰 飞行"
	],
	[
			88,
			"自然 圣灵"
	],
	[
			89,
			"混沌 圣灵"
	],
	[
			90,
			"远古 邪灵"
	],
	[
			91,
			"自然 冰"
	],
	[
			92,
			"混沌 暗影"
	],
	[
			93,
			"混沌 战斗"
	],
	[
			94,
			"混沌 超能"
	],
	[
			95,
			"圣灵 超能"
	],
	[
			96,
			"混沌 地面"
	],
	[
			97,
			"暗影 邪灵"
	],
	[
			98,
			"混沌 远古"
	],
	[
			99,
			"混沌 邪灵"
	],
	[
			100,
			"圣灵 地面"
	],
	[
			101,
			"火 暗影"
	],
	[
			102,
			"光 超能"
	],
	[
			103,
			"机械 战斗"
	],
	[
			104,
			"飞行 电"
	],
	[
			105,
			"混沌 飞行"
	],
	[
			106,
			"混沌 龙"
	],
	[
			107,
			"混沌 火"
	],
	[
			108,
			"圣灵 火"
	],
	[
			109,
			"地面 神秘"
	],
	[
			110,
			"混沌 次元"
	],
	[
			111,
			"混沌 冰"
	],
	[
			112,
			"自然 神秘"
	],
	[
			113,
			"虚空 邪灵"
	],
	[
			114,
			"虚空 混沌"
	],
	[
			115,
			"圣灵 轮回"
	],
	[
			116,
			"水 次元"
	],
	[
			117,
			"圣灵 神秘"
	],
	[
			118,
			"机械 神秘"
	],
	[
			119,
			"水 神秘"
	],
	[
			120,
			"次元 龙"
	],
	[
			121,
			"自然 超能"
	],
	[
			221,
			"王"
	],
	[
			222,
			"混沌"
	],
	[
			223,
			"神灵"
	],
	[
			224,
			"轮回"
	],
	[
			225,
			"虫"
	],
	[
			226,
			"虚空"
	]
]));
	